/*
任务描述:

我们将年收入分为不同的档次，每个档次使用不同的税率计算个人所得税。

如果年收入小于等于36000元，则个人所得税为0元；
如果年收入大于36000元 小于144000元，超出36000 部分按照 0.03交税；
如果收入大于144000元小于等于300000 元 ,需要交12000 的底税，超出144000 部分按照0.2 交税；
如果收入大于300000元小于等于420000元 ,需要交26000的底税,超出300000 部分按照0.25 交税;
如果收入大于420000元小于等于660000元 ,需要交44000的底税,超出420000部分按照0.3 交税;
如果收入大于660000元小于等于960000元 ,需要交71000的底税,超出660000部分按照0.35 交税;
如果收入大于960000元 ,需要交151050的底税,超出960000部分按照0.45 交税;
 */
#include <stdio.h>
int main(){
    double shouru;
    printf("请输入你的收入:");
    scanf("%lf",&shouru);
    if(shouru<=0)printf("你输入的收入不对");
    else if(shouru<=36000) printf("您需要缴纳的个人所得税为：0");
    else if(shouru<144000)printf("您需要缴纳的个人所得税为：%.2lf\n", (shouru-36000)*0.03);
    else if(shouru<=300000)printf("您需要缴纳的个人所得税为：%.2lf\n",1200+(shouru-144000)*0.2);
    else if(shouru<=420000)printf("您需要缴纳的个人所得税为：%.2lf\n", 26000+(shouru-300000)*0.25);
    else if(shouru<=660000)printf("您需要缴纳的个人所得税为：%.2lf\n", 44000+(shouru-420000)*0.3);
    else if(shouru<=960000)printf("您需要缴纳的个人所得税为：%.2lf\n", 71000+(shouru-660000)*0.35);
    else printf("您需要缴纳的个人所得税为：%.2lf\n", 151050+(shouru-960000)*0.45);
    return 0;
}
